x247162/SSY_projekt/Zigbee_OnOff_Client_Router/Drivers/BSP/STM32WBAxx_Nucleo/stm32wbaxx_nucleo_xspi.c
/**
  ******************************************************************************
  * @file    stm32wbaxx_nucleo_xspi.c
  * @author  MCD Application Team
  * @brief   This file includes a standard driver for the MX25R3235F
  *          XSPI memory mounted on the STM32WBAXX-NUCLEO board.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) This driver is used to drive the MX25R3235F Quad NOR external memory
       mounted on STM32WBAXX_NUCLEO board.

   (#) This driver need specific component driver (MX25R3235F) to be included with.

   (#) MX25R3235F Initialization steps:
       (++) Initialize the XSPI external memory using the BSP_XSPI_Init() function. This
            function includes the MSP layer hardware resources initialization and the
            XSPI interface with the external memory.

   (#) MX25R3235F Quad NOR memory operations
       (++) XSPI memory can be accessed with read/write operations once it is
            initialized.
            Read/write operation can be performed with AHB access using the functions
            BSP_XSPI_Read()/BSP_XSPI_Write().
       (++) The function BSP_XSPI_GetInfo() returns the configuration of the XSPI memory.
            (see the XSPI memory data sheet)
       (++) Perform erase block operation using the function BSP_XSPI_Erase_Block() and by
            specifying the block address. You can perform an erase operation of the whole
            chip by calling the function BSP_XSPI_Erase_Chip().
       (++) The function BSP_XSPI_GetStatus() returns the current status of the XSPI memory.
            (see the XSPI memory data sheet)
       (++) The memory access can be configured in memory-mapped mode with the call of
            function BSP_XSPI_EnableMemoryMapped(). To go back in indirect mode, the
            function BSP_XSPI_DisableMemoryMapped() should be used.
       (++) The erase operation can be suspend and resume with using functions
            BSP_XSPI_SuspendErase() and BSP_XSPI_ResumeErase()
       (++) It is possible to put the memory in deep power-down mode to reduce its consumption.
            For this, the function BSP_XSPI_EnterDeepPowerDown() should be called. To leave
            the deep power-down mode, the function BSP_XSPI_LeaveDeepPowerDown() should be called.
       (++) The function BSP_XSPI_ReadID() returns the identifier of the memory
            (see the XSPI memory data sheet)
       (++) The configuration of the interface between peripheral and memory is done by
            the function XSPI_ConfigFlash(), two modes are possible :
            - SPI : instruction, address and data on one line
            - QPI : instruction on one line while address and data on four lines with sampling on one edge of clock

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx_nucleo_xspi.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32WBAXX_NUCLEO
  * @{
  */

/** @defgroup STM32WBAXX_NUCLEO_XSPI STM32WBAXX_NUCLEO XSPI
  * @{
  */

/* Exported variables --------------------------------------------------------*/
/** @addtogroup STM32WBAXX_NUCLEO_XSPI_Exported_Variables
  * @{
  */
XSPI_HandleTypeDef hxspi[XSPI_INSTANCES_NUMBER] = {0};
XSPI_Ctx_t Xspi_Ctx[XSPI_INSTANCES_NUMBER] =
{
  {
    XSPI_ACCESS_NONE,
    MX25R3235F_SPI_MODE
  }
};
/**
  * @}
  */


/* Private constants --------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup STM32WBAXX_NUCLEO_XSPI_Private_Variables STM32WBAXX_NUCLEO XSPI Private Variables
  * @{
  */
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 1)
static uint32_t Xspi_IsMspCbValid[XSPI_INSTANCES_NUMBER] = {0};
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32WBAXX_NUCLEO_XSPI_Private_Functions STM32WBAXX_NUCLEO XSPI Private Functions
  * @{
  */
static void    XSPI_MspInit(XSPI_HandleTypeDef *hxspi);
static void    XSPI_MspDeInit(XSPI_HandleTypeDef *hxspi);
static int32_t XSPI_ResetMemory(uint32_t Instance);
static int32_t XSPI_EnterQPIMode(uint32_t Instance);
static int32_t XSPI_ExitQPIMode(uint32_t Instance);
static void    XSPI_DLYB_Enable(uint32_t Instance);
static int32_t XSPI_AutoPollingMemReady(XSPI_HandleTypeDef *hxspi);
static int32_t XSPI_ConfigFlash(uint32_t Instance, BSP_XSPI_Interface_t Mode);

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/

/** @addtogroup STM32WBAXX_NUCLEO_XSPI_Exported_Functions
  * @{
  */

/**
  * @brief  Initializes the XSPI interface.
  * @param  Instance   XSPI Instance
  * @param  Init       XSPI Init structure
  * @retval BSP status
  */
int32_t BSP_XSPI_Init(uint32_t Instance, BSP_XSPI_Init_t *Init)
{
  int32_t ret;
  BSP_XSPI_Info_t pInfo;
  MX_XSPI_InitTypeDef xspi_init;

  /* Check if the instance is supported */
  if (Instance >= XSPI_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if the instance is already initialized */
    if (Xspi_Ctx[Instance].IsInitialized == XSPI_ACCESS_NONE)
    {
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 0)
      /* Msp XSPI initialization */
      XSPI_MspInit(&hxspi[Instance]);
#else
      /* Register the XSPI MSP Callbacks */
      if (Xspi_IsMspCbValid[Instance] == 0UL)
      {
        if (BSP_XSPI_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */

      /* Get Flash information of one memory */
      (void)MX25R3235F_GetFlashInfo(&pInfo);

      /* Fill config structure */
      xspi_init.ClockPrescaler = 8;
      xspi_init.MemorySize     = (uint32_t)POSITION_VAL((uint32_t)pInfo.FlashSize);
      xspi_init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;

      /* STM32 XSPI interface initialization */
      if (MX_XSPI_Init(&hxspi[Instance], &xspi_init) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* XSPI Delay Block enable */
        XSPI_DLYB_Enable(Instance);

        /* XSPI memory reset */
        if (XSPI_ResetMemory(Instance) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }/* Check if memory is ready */
        else if (XSPI_AutoPollingMemReady(&hxspi[Instance]) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }/* Configure the memory */
        else if (XSPI_ConfigFlash(Instance, Init->InterfaceMode) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          ret = BSP_ERROR_NONE;
        }
      }
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  De-Initializes the XSPI interface.
  * @param  Instance   XSPI Instance
  * @retval BSP status
  */
int32_t BSP_XSPI_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

