x247162/SSY_projekt/Zigbee_OnOff_Client_Router/Drivers/BSP/STM32WBAxx_Nucleo/stm32wbaxx_nucleo_xspi.c
  if (MX25R3235F_ReadStatusRegister(&hxspi[Instance], &reg) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* Enable write operations */
  if (MX25R3235F_WriteEnable(&hxspi[Instance]) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* Activate/deactivate the Quad mode */
  SET_BIT(reg, MX25R3235F_SR_QE);

  if (MX25R3235F_WriteStatusRegister(&hxspi[Instance], reg) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* Wait that memory is ready */
  if (XSPI_AutoPollingMemReady(&hxspi[Instance]) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if (MX25R3235F_ReadStatusRegister(&hxspi[Instance], &reg) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if ((reg & MX25R3235F_SR_QE) == 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  This function disables the quad mode of the memory.
  * @param  Instance  XSPI instance
  * @retval BSP status
  */
static int32_t XSPI_ExitQPIMode(uint32_t Instance)
{
  uint8_t reg;

  if (MX25R3235F_ReadStatusRegister(&hxspi[Instance], &reg) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* Enable write operations */
  if (MX25R3235F_WriteEnable(&hxspi[Instance]) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* Activate/deactivate the Quad mode */
  CLEAR_BIT(reg, MX25R3235F_SR_QE);

  if (MX25R3235F_WriteStatusRegister(&hxspi[Instance], reg) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  /* Wait that memory is ready */
  if (XSPI_AutoPollingMemReady(&hxspi[Instance]) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if (MX25R3235F_ReadStatusRegister(&hxspi[Instance], &reg) != MX25R3235F_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  if ((reg & MX25R3235F_SR_QE) != 0U)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  This function enables delay block.
  * @param  Instance  XSPI instance
  * @retval BSP status
  */
static void XSPI_DLYB_Enable(uint32_t Instance)
{
  HAL_XSPI_DLYB_CfgTypeDef  dlyb_cfg;

  (void)HAL_XSPI_DLYB_GetClockPeriod(&hxspi[Instance], &dlyb_cfg);

  /* PhaseSel is divided by 4 (emperic value)*/
  dlyb_cfg.PhaseSel /= 4U;

  /*set delay block configuration*/
  (void)HAL_XSPI_DLYB_SetConfig(&hxspi[Instance], &dlyb_cfg);
}

/**
  * @brief  Polling WIP(Write In Progress) bit become to 0
  *         XSPI;
  * @param  hxspi XSPI handle
  * @retval BSP status
  */
static int32_t XSPI_AutoPollingMemReady(XSPI_HandleTypeDef *hxspi)
{
  uint8_t reg;
  uint32_t timeout = HAL_XSPI_TIMEOUT_DEFAULT_VALUE;

  reg = 0xFFU;

  while(((reg & MX25R3235F_SR_WIP) == 1) && (timeout > 0U))
  {
    if (MX25R3235F_ReadStatusRegister(hxspi, &reg) != MX25R3235F_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }
    timeout--;
  }
  if ((reg & MX25R3235F_SR_WIP) == 1)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return BSP_ERROR_NONE;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
